In [1]:
import pandas as pd

In [2]:
# 16. merge - Merging DataFrames

In [9]:
# 1. Merge two DataFrames on a common column "Product_ID"
df1 = pd.DataFrame({"Product_ID": [1, 2, 3], "Product_Name": ["Laptop", "Phone", "Tablet"]})
df2 = pd.DataFrame({"Product_ID": [1, 2, 4], "Price": [1000, 500, 300]})

In [10]:
df1

   Product_ID Product_Name
0           1       Laptop
1           2        Phone
2           3       Tablet

In [11]:
df2

   Product_ID  Price
0           1   1000
1           2    500
2           4    300

In [18]:
merged_df = pd.merge(df1, df2, on="Product_ID")

In [19]:
merged_df

   Product_ID Product_Name  Price
0           1       Laptop   1000
1           2        Phone    500

In [20]:
# 2. Perform a left join between two DataFrames based on "Employee_ID"
df1 = pd.DataFrame({"Employee_ID": [1, 2, 3], "Name": ["Alice", "Bob", "Charlie"]})
df2 = pd.DataFrame({"Employee_ID": [1, 2, 4], "Salary": [50000, 60000, 70000]})

In [21]:
left_join_df = pd.merge(df1, df2, on="Employee_ID", how="left")

In [22]:
left_join_df

   Employee_ID     Name   Salary
0            1    Alice  50000.0
1            2      Bob  60000.0
2            3  Charlie      NaN

In [25]:
# 3. Merge two DataFrames, keeping all rows from the left DataFrame and matching rows from the right
df_merged = pd.merge(df1, df2, on="Employee_ID", how="left")

In [26]:
df_merged

   Employee_ID     Name   Salary
0            1    Alice  50000.0
1            2      Bob  60000.0
2            3  Charlie      NaN

In [27]:
# 4. Merge two DataFrames on multiple columns (e.g., "City" and "Age")
df1 = pd.DataFrame({"City": ["NY", "LA", "SF"], "Age": [25, 30, 35]})
df2 = pd.DataFrame({"City": ["NY", "LA", "SF"], "Age": [25, 30, 40], "Salary": [60000, 70000,80000]})

In [28]:
merged_df = pd.merge(df1, df2, on=["City", "Age"], how="inner")

In [29]:
merged_df

  City  Age  Salary
0   NY   25   60000
1   LA   30   70000

In [30]:
# 5. Perform an inner join on two DataFrames with a common column "Country"
df1 = pd.DataFrame({"Country": ["USA", "Canada", "India"], "Population": [331, 38, 1391]})
df2 = pd.DataFrame({"Country": ["USA", "India", "UK"], "GDP": [21, 3, 2.6]})

In [31]:
inner_join_df = pd.merge(df1, df2, on="Country", how="inner")

In [32]:
inner_join_df

  Country  Population   GDP
0     USA         331  21.0
1   India        1391   3.0

In [33]:
# 6. Merge two DataFrames and keep all rows, even if there’s no match in the second DataFrame
df_full_merge = pd.merge(df1, df2, on="Country", how="outer")

In [34]:
df_full_merge

  Country  Population   GDP
0     USA       331.0  21.0
1  Canada        38.0   NaN
2   India      1391.0   3.0
3      UK         NaN   2.6

In [35]:
# 17. Saving and Exporting Data

In [39]:
ds = pd.read_csv("fitness_tracker_data.csv")

In [40]:
# 1. Save the DataFrame to a new CSV file
ds.to_csv("fitness_tracker_data.csv", index=False)

In [41]:
# 2. Export the DataFrame to an Excel file
ds.to_excel("fitness_tracker_data.xlsx", index=False)